tetsu880101/stm8s/src/stm8s_max72xx.c
#include "stm8s_max72xx.h"




/*
Function Name: string_len
Description: It can be used to get the length of a String.
Return type: int.
*/

const char alphabets[26]= "ABCDEFGHIJKLMNOPQRSTUVWXYZ";

const uint8_t alpha_char[26][8] = {
    {0x00, 0xFC, 0xFE, 0x27, 0x27, 0xFE, 0xFC, 0x00}, // A
    {0x00, 0xFE, 0xFE, 0x92, 0x92, 0xFE, 0x6C, 0x00}, // B
    {0x00, 0x7E, 0xFF, 0x81, 0x81, 0xC3, 0x42, 0x00}, // C 
    {0x00, 0xFF, 0xFF, 0x81, 0x81, 0xFF, 0x7E, 0x00}, // D
    {0x00, 0xFF, 0xFF, 0x91, 0x91, 0x81, 0x81, 0x00}, // E 
    {0x00, 0xFF, 0xFF, 0x11, 0x11, 0x01, 0x01, 0x00}, // F
    {0x00, 0x7E, 0xFF, 0x81, 0x91, 0xF1, 0x71, 0x00}, // G 
    {0x00, 0xFF, 0xFF, 0x10, 0x10, 0xFF, 0xFF, 0x00}, // H
    {0x00, 0x81, 0x81, 0xFF, 0xFF, 0x81, 0x81, 0x00}, // I
    {0x00, 0x40, 0xC0, 0x81, 0xFF, 0x7F, 0x01, 0x00}, // J 
    {0x00, 0xFF, 0xFF, 0x18, 0x3C, 0x66, 0xC3, 0x00}, // K
    {0x00, 0xFF, 0xFF, 0x80, 0x80, 0x80, 0x80, 0x00}, // L
    {0x00, 0xFF, 0xFF, 0x0C, 0x18, 0x0C, 0xFF, 0xFF}, // M
    {0x00, 0xFF, 0xFF, 0x0C, 0x18, 0x30, 0xFF, 0xFF}, // N
    {0x00, 0x7E, 0xFF, 0x81, 0x81, 0xFF, 0x7E, 0x00}, // O
    {0x00, 0xFF, 0xFF, 0x11, 0x11, 0x1F, 0x0E, 0x00}, // P
    {0x00, 0x7E, 0xFF, 0x81, 0xC1, 0xFF, 0xBE, 0x00}, // Q 
    {0x00, 0xFF, 0xFF, 0x11, 0x31, 0x7F, 0xCE, 0x00}, // R
    {0x00, 0xC6, 0xCF, 0x89, 0x99, 0xF9, 0x71, 0x00}, // S
    {0x00, 0x01, 0x01, 0xFF, 0xFF, 0x01, 0x01, 0x00}, // T
    {0x00, 0x7F, 0xFF, 0x80, 0x80, 0xFF, 0x7F, 0x00}, // U
    {0x00, 0x3F, 0x7F, 0xC0, 0xC0, 0x7F, 0x3F, 0x00}, // V
    {0x00, 0xFF, 0xFF, 0x60, 0x30, 0x60, 0xFF, 0xFF}, // W
    {0x00, 0xC3, 0xE7, 0x3C, 0x18, 0x3C, 0xE7, 0xC3}, // X
    {0x00, 0x03, 0x07, 0xFC, 0xFC, 0x07, 0x03, 0x00}, // Y 
    {0x00, 0xE3, 0xF3, 0x99, 0x8D, 0x87, 0x83, 0x00}  // Z
};


int string_len(char *string1)
{
    int len = 0;
    while(*string1 != 0) {
        string1++;
        len++;
    }
    return len;
}


/*
Function Name: MAX7219_init
Description: It can be used to initiate MAX7219 device.
type: void.
*/

void MAX7219_init(void)
{
    GPIO_Init(ChipSelect_port, ChipSelect_pin, GPIO_MODE_OUT_PP_HIGH_FAST);
 
    SPI_write(shutdown_reg, run_cmd);                 
    SPI_write(decode_mode_reg, 0x00);
    SPI_write(scan_limit_reg, 0x07);
    SPI_write(intensity_reg, 0x04);
    SPI_write(display_test_reg, test_cmd);
    delay_ms(10);     
    SPI_write(display_test_reg, no_test_cmd);  
}


/*
Function Name: diplay_clear
Description: It can be used to clear the matrix for once with 100 ms delay.
Return type: void.
*/

void display_clear(void) {
	    unsigned char zeros_clr[8] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
 unsigned char j = 0x00;
	
	for(j = 0; j < sizeof(zeros_clr); j++)
	{
			
			SPI_write((1 + j),zeros_clr[j]);
			delay_ms(100);
	}

}


		
			
/*
Function Name: display_char
Description: It can be used to print a Character on the 8x8 matrix for once with 100 ms delay.
Return type: void.
*/



void display_char(int alphabet_sequence)
{
	  unsigned int i;

		for(i=0; i<8; i++){
	SPI_write((i+1), alpha_char[alphabet_sequence][i]);
		
		delay_ms(100);
		
		}

}

/*
Function Name: display_string
Description: It can be used to display a string on the 8x8 matrix for once with 1000 ms delay.
type: void.
*/


void display_string(const char string[]){
		
    unsigned char j,pos;
		
    int input_string_length  = string_len(string);
		int alphabets_length  = string_len(alphabets);
		
	for(j=0; j<input_string_length; j++){
	pos = 0;
	while(alphabets[pos]!='\0'){
		
	if(string[j] == alphabets[pos])
		display_char(pos);
	
	pos++;	
	delay_ms(500);
	}
}

}

void SPI_Clock_Config(void)
{
     CLK_DeInit();
                
 
     CLK_HSICmd(ENABLE);
     while(CLK_GetFlagStatus(CLK_FLAG_HSIRDY) == FALSE);
     CLK_ClockSwitchCmd(ENABLE);
     CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
     CLK_SYSCLKConfig(CLK_PRESCALER_CPUDIV1);                
     CLK_ClockSwitchConfig(CLK_SWITCHMODE_AUTO, CLK_SOURCE_HSI, 
     DISABLE, CLK_CURRENTCLOCKSTATE_ENABLE);
                
     CLK_PeripheralClockConfig(CLK_PERIPHERAL_SPI, ENABLE);
 
}

void SPI_GPIO_setup(void)
{
     GPIO_DeInit(GPIOC);
     GPIO_Init(GPIOC, (GPIO_Pin_TypeDef)(GPIO_PIN_5 | GPIO_PIN_6), 
          GPIO_MODE_OUT_PP_HIGH_FAST);
}

void SPI_print(void)
{
		display_clear(); //Clearing the Display
		display_string(alphabets);  //Displaying a String
		delay_ms(2000);
}

